In [1]:
#establish connection the Postgres Database
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://postgres:secret@localhost/PHEmp_DB')
connection = engine.connect()

In [2]:
#import the salaries and titles tables from Postgres
import pandas as pd
titles = pd.read_sql("SELECT * FROM titles", connection)
salaries = pd.read_sql("SELECT * FROM salaries", connection)
#employees = pd.read_sql("SELECT * FROM employees", connection)

In [3]:
#merge titles and salaries table.
#use right join because titles to salaries is many to one
mdb = pd.merge(titles, salaries, on = "emp_no", how = "right")
mdb.head()

,emp_no,title,from_date_x,to_date_x,salary,from_date_y,to_date_y
0,10001,Senior Engineer,1986-06-26,9999-01-01,60117,1986-06-26,1987-06-26
1,10002,Staff,1996-08-03,9999-01-01,65828,1996-08-03,1997-08-03
2,10003,Senior Engineer,1995-12-03,9999-01-01,40006,1995-12-03,1996-12-02
3,10004,Engineer,1986-12-01,1995-12-01,40054,1986-12-01,1987-12-01
4,10004,Senior Engineer,1995-12-01,9999-01-01,40054,1986-12-01,1987-12-01

In [4]:
#find the mean salary by title
mdb = mdb[["title","salary"]].groupby(["title"])
title_salary = pd.DataFrame(mdb["salary"].mean())

#drop title index so that it is a variable
title_salary = title_salary.reset_index(drop = False)

#change the order of titles to be more meaningful
title_salary["sort"] = [0,1,6,2,4,3,5]
title_salary = title_salary.sort_values("sort", ascending = True)
title_salary = title_salary[["title","salary"]]
title_salary

                title        salary
0  Assistant Engineer  48493.204786
1            Engineer  48539.781423
3     Senior Engineer  48506.751806
5               Staff  58465.271904
4        Senior Staff  58503.286614
6    Technique Leader  48580.505772
2             Manager  51531.041667

In [5]:
#bar chart of titles by salary
import matplotlib.pyplot as plt
import numpy as np

fig_bar, ax_bar = plt.subplots(figsize = (15,5))
x = np.arange(len(title_salary["title"]))
ax_bar.bar(x, title_salary["salary"], color='b', alpha=0.8, align="center",width = .7)

# Tidy up the chart by adding axis label, title, and labeling drugs on the x-axis 
ax_bar.set_title("Average Salary by Title")
ax_bar.set_ylabel("Dollars")
plt.ylim(40000,60000)
plt.xticks(x, title_salary["title"], ha = "center")

#export figure as png
plt.savefig("Average Salary by Title.png")